Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/comp_b.c
        param.positiveTerminalInput = positiveTerminalInput;
        param.negativeTerminalInput = negativeTerminalInput;
        param.powerModeSelect = powerModeSelect;
        param.outputFilterEnableAndDelayLevel = outputFilterEnableAndDelayLevel;
        param.invertedOutputPolarity = invertedOutputPolarity;

        return COMP_B_initialize(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Initializes the COMP_B Module.
//!
//! Upon successful initialization of the COMP_B module, this function will
//! have reset all necessary register bits and set the given options in the
//! registers. To actually use the COMP_B module, the COMP_B_enable() function
//! must be explicitly called before use. If a Reference Voltage is set to a
//! terminal, the Voltage should be set using the COMP_B_setReferenceVoltage()
//! function.
//!
//! \param baseAddress is the base address of the COMP_B module.
//! \param param is the pointer to struct for initialization.
//!
//! \return STATUS_SUCCESS or STATUS_FAILURE of the initialization process.
//
//*****************************************************************************
bool COMP_B_initialize(uint16_t baseAddress, COMP_B_initializeParam *param)
{
        assert(param != 0);
        assert(param->positiveTerminalInput <= COMP_B_VREF);
        assert(param->negativeTerminalInput <= COMP_B_VREF);
        assert(param->positiveTerminalInput != param->negativeTerminalInput);
        assert(param->powerModeSelect <= COMP_B_POWERMODE_ULTRALOWPOWER);
        assert(param->outputFilterEnableAndDelayLevel <= COMP_B_FILTEROUTPUT_DLYLVL4);

        bool retVal = STATUS_SUCCESS;

        //Reset COMPB Control 1 & Interrupt Registers for initialization (OFS_CBCTL3
        //is not reset because it controls the input buffers of the analog signals
        //and may cause parasitic effects if an analog signal is still attached and
        //the buffer is re-enabled
        HWREG16(baseAddress + OFS_CBCTL0) &= 0x0000;
        HWREG16(baseAddress + OFS_CBINT)  &= 0x0000;

        //Set the Positive Terminal
        if (COMP_B_VREF != param->positiveTerminalInput) {
                //Enable Positive Terminal Input Mux and Set it to the appropriate input
                HWREG16(baseAddress + OFS_CBCTL0) |= CBIPEN + param->positiveTerminalInput;

                //Disable the input buffer
                HWREG16(baseAddress + OFS_CBCTL3) |= (1 << param->positiveTerminalInput);
        } else
                //Reset and Set COMPB Control 2 Register
                HWREG16(baseAddress + OFS_CBCTL2) &= ~(CBRSEL); //Set Vref to go to (+)terminal

        //Set the Negative Terminal
        if (COMP_B_VREF != param->negativeTerminalInput) {
                //Enable Negative Terminal Input Mux and Set it to the appropriate input
                HWREG16(baseAddress + OFS_CBCTL0) |= CBIMEN + (param->negativeTerminalInput << 8);

                //Disable the input buffer
                HWREG16(baseAddress + OFS_CBCTL3) |= (1 << param->negativeTerminalInput);
        } else
                //Reset and Set COMPB Control 2 Register
                HWREG16(baseAddress + OFS_CBCTL2) |= CBRSEL; //Set Vref to go to (-) terminal

        //Reset and Set COMPB Control 1 Register
        HWREG16(baseAddress + OFS_CBCTL1) =
                param->powerModeSelect                          //Set the power mode
                + param->outputFilterEnableAndDelayLevel        //Set the filter enable bit and delay
                + param->invertedOutputPolarity;                //Set the polarity of the output

        return retVal;
}

//*****************************************************************************
//
//! \brief DEPRECATED - Generates a Reference Voltage to the terminal selected
//! during initialization.
//!
//! Use this function to generate a voltage to serve as a reference to the
//! terminal selected at initialization. The voltage is determined by the
//! equation: Vbase * (Numerator / 32). If the upper and lower limit voltage
//! numerators are equal, then a static reference is defined, whereas they are
//! different then a hysteresis effect is generated.
//!
//! \param baseAddress is the base address of the COMP_B module.
//! \param supplyVoltageReferenceBase decides the source and max amount of
//!        Voltage that can be used as a reference.
//!        Valid values are:
//!        - \b COMP_B_VREFBASE_VCC
//!        - \b COMP_B_VREFBASE1_5V
//!        - \b COMP_B_VREFBASE2_0V
//!        - \b COMP_B_VREFBASE2_5V
//!        \n Modified bits are \b CBREFL of \b CBCTL2 register.
//! \param lowerLimitSupplyVoltageFractionOf32 is the numerator of the equation
//!        to generate the reference voltage for the lower limit reference
//!        voltage.
//!        \n Modified bits are \b CBREF0 of \b CBCTL2 register.
//! \param upperLimitSupplyVoltageFractionOf32 is the numerator of the equation
//!        to generate the reference voltage for the upper limit reference
//!        voltage.
//!        \n Modified bits are \b CBREF1 of \b CBCTL2 register.
//! \param referenceAccuracy is the reference accuracy setting of the COMP_B.
//!        Clocked is for low power/low accuracy.
//!        Valid values are:
//!        - \b COMP_B_ACCURACY_STATIC
//!        - \b COMP_B_ACCURACY_CLOCKED
//!        \n Modified bits are \b CDREFACC of \b CDCTL2 register.
//!
//! \return None
//
//*****************************************************************************
void COMP_B_setReferenceVoltage(uint16_t baseAddress,
                                uint16_t supplyVoltageReferenceBase,
                                uint16_t lowerLimitSupplyVoltageFractionOf32,
                                uint16_t upperLimitSupplyVoltageFractionOf32,
                                uint16_t referenceAccuracy)
{
        COMP_B_configureReferenceVoltageParam param = { 0 };

        param.supplyVoltageReferenceBase = supplyVoltageReferenceBase;
        param.lowerLimitSupplyVoltageFractionOf32 = lowerLimitSupplyVoltageFractionOf32;
        param.upperLimitSupplyVoltageFractionOf32 = upperLimitSupplyVoltageFractionOf32;
        param.referenceAccuracy = referenceAccuracy;

