Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/comp_b.c
        COMP_B_configureReferenceVoltage(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Generates a Reference Voltage to the terminal selected during
//! initialization.
//!
//! Use this function to generate a voltage to serve as a reference to the
//! terminal selected at initialization. The voltage is determined by the
//! equation: Vbase * (Numerator / 32). If the upper and lower limit voltage
//! numerators are equal, then a static reference is defined, whereas they are
//! different then a hysteresis effect is generated.
//!
//! \param baseAddress is the base address of the COMP_B module.
//! \param param is the pointer to struct for reference voltage configuration.
//!
//! \return None
//
//*****************************************************************************
void COMP_B_configureReferenceVoltage(uint16_t baseAddress,
                                      COMP_B_configureReferenceVoltageParam *param)
{
        assert(param != 0);
        assert(param->supplyVoltageReferenceBase <= COMP_B_VREFBASE2_5V);
        assert(param->upperLimitSupplyVoltageFractionOf32 <= 32);
        assert(param->lowerLimitSupplyVoltageFractionOf32 <= 32);
        assert(param->upperLimitSupplyVoltageFractionOf32
               >= param->lowerLimitSupplyVoltageFractionOf32);

        HWREG16(baseAddress + OFS_CBCTL1) &= ~(CBMRVS); //Set to VREF0

        //Reset COMPB Control 2 Bits (Except for CBRSEL which is set in Comp_Init() )
        HWREG16(baseAddress + OFS_CBCTL2) &= CBRSEL;

        //Set Voltage Source (Vcc | Vref, resistor ladder or not)
        if (COMP_B_VREFBASE_VCC == param->supplyVoltageReferenceBase)
                HWREG16(baseAddress + OFS_CBCTL2) |= CBRS_1; //Vcc with resistor ladder
        else if (param->lowerLimitSupplyVoltageFractionOf32 == 32) {
                //If the lower limit is 32, then the upper limit has to be 32 due to the
                //assertion that upper must be >= to the lower limit. If the numerator is
                //equal to 32, then the equation would be 32/32 == 1, therefore no resistor
                //ladder is needed
                HWREG16(baseAddress + OFS_CBCTL2) |= CBRS_3;    //Vref, no resistor ladder
        } else
                HWREG16(baseAddress + OFS_CBCTL2) |= CBRS_2;    //Vref with resistor ladder

        //Set COMPD Control 2 Register
        HWREG16(baseAddress + OFS_CBCTL2) |=
                param->supplyVoltageReferenceBase                               //Set Supply Voltage Base
                + ((param->upperLimitSupplyVoltageFractionOf32 - 1) << 8)       //Set Supply Voltage Num.
                + (param->lowerLimitSupplyVoltageFractionOf32 - 1);

        HWREG16(baseAddress + OFS_CBCTL2) &= ~(CBREFACC);
        HWREG16(baseAddress + OFS_CBCTL2) |= param->referenceAccuracy;
} //*****************************************************************************
//
//! \brief Enables selected COMP_B interrupt sources.
//!
//! Enables the indicated COMP_B interrupt sources.  Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor. Does not clear interrupt flags.
//!
//! \param baseAddress is the base address of the COMP_B module.
//! \param interruptMask is the bit mask of the interrupt sources to be
//!        enabled.
//!        Mask value is the logical OR of any of the following:
//!        - \b COMP_B_OUTPUT_INT - Output interrupt
//!        - \b COMP_B_OUTPUTINVERTED_INT - Output interrupt inverted polarity
//!        \n Modified bits of \b CBINT register.
//!
//! \return None
//
//*****************************************************************************
void COMP_B_enableInterrupt(uint16_t baseAddress,
                            uint16_t interruptMask)
{
        //Set the Interrupt enable bit
        HWREG16(baseAddress + OFS_CBINT) |= interruptMask;
}

//*****************************************************************************
//
//! \brief Disables selected COMP_B interrupt sources.
//!
//! Disables the indicated COMP_B interrupt sources.  Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor.
//!
//! \param baseAddress is the base address of the COMP_B module.
//! \param interruptMask is the bit mask of the interrupt sources to be
//!        disabled.
//!        Mask value is the logical OR of any of the following:
//!        - \b COMP_B_OUTPUT_INT - Output interrupt
//!        - \b COMP_B_OUTPUTINVERTED_INT - Output interrupt inverted polarity
//!        \n Modified bits of \b CBINT register.
//!
//! \return None
//
//*****************************************************************************
void COMP_B_disableInterrupt(uint16_t baseAddress,
                             uint16_t interruptMask)
{
        HWREG16(baseAddress + OFS_CBINT) &= ~(interruptMask);
}

//*****************************************************************************
//
//! \brief Clears COMP_B interrupt flags.
//!
//! The COMP_B interrupt source is cleared, so that it no longer asserts. The
//! highest interrupt flag is automatically cleared when an interrupt vector
//! generator is used.
//!
//! \param baseAddress is the base address of the COMP_B module.
//! \param interruptFlagMask is a bit mask of the interrupt sources to be
//!        cleared.
//!        Mask value is the logical OR of any of the following:
//!        - \b COMP_B_OUTPUT_FLAG - Output interrupt
//!        - \b COMP_B_OUTPUTINVERTED_FLAG - Output interrupt inverted polarity
//!        \n Modified bits of \b CBINT register.
//!
//! \return None
//
//*****************************************************************************
void COMP_B_clearInterrupt(uint16_t baseAddress,
                           uint16_t interruptFlagMask)
{
        HWREG16(baseAddress + OFS_CBINT) &= ~(interruptFlagMask);
}

//*****************************************************************************
//
//! \brief Gets the current COMP_B interrupt status.
//!
//! This returns the interrupt status for the COMP_B module based on which flag
//! is passed.
//!
//! \param baseAddress is the base address of the COMP_B module.
//! \param interruptFlagMask is the masked interrupt flag status to be
//!        returned.
//!        Mask value is the logical OR of any of the following:
//!        - \b COMP_B_OUTPUT_FLAG - Output interrupt
//!        - \b COMP_B_OUTPUTINVERTED_FLAG - Output interrupt inverted polarity
//!
//! \return Logical OR of any of the following:
//!         - \b COMP_B_OUTPUT_FLAG Output interrupt
//!         - \b COMP_B_OUTPUTINVERTED_FLAG Output interrupt inverted polarity
//!         \n indicating the status of the masked interrupts
//
//*****************************************************************************
uint8_t COMP_B_getInterruptStatus(uint16_t baseAddress,
                                  uint16_t interruptFlagMask)
{
        return HWREG16(baseAddress + OFS_CBINT) & interruptFlagMask;
}

//*****************************************************************************
//
//! \brief Explicitly sets the edge direction that would trigger an interrupt.
//!
//! This function will set which direction the output will have to go, whether
//! rising or falling, to generate an interrupt based on a non-inverted
//! interrupt.
//!
//! \param baseAddress is the base address of the COMP_B module.
//! \param edgeDirection determines which direction the edge would have to go
//!        to generate an interrupt based on the non-inverted interrupt flag.
//!        Valid values are:
//!        - \b COMP_B_FALLINGEDGE [Default] - sets the bit to generate an
//!           interrupt when the output of the COMP_B falls from HIGH to LOW if
//!           the normal interrupt bit is set(and LOW to HIGH if the inverted
//!           interrupt enable bit is set).
//!        - \b COMP_B_RISINGEDGE - sets the bit to generate an interrupt when
//!           the output of the COMP_B rises from LOW to HIGH if the normal
//!           interrupt bit is set(and HIGH to LOW if the inverted interrupt
//!           enable bit is set).
//!        \n Modified bits are \b CBIES of \b CBCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void COMP_B_interruptSetEdgeDirection(uint16_t baseAddress,
                                      uint16_t edgeDirection)
{
        assert(edgeDirection <= COMP_B_RISINGEDGE);

        //Set the edge direction that will trigger an interrupt
        if (COMP_B_RISINGEDGE == edgeDirection)
                HWREG16(baseAddress + OFS_CBCTL1) |= CBIES;
        else if (COMP_B_FALLINGEDGE == edgeDirection)
                HWREG16(baseAddress + OFS_CBCTL1) &= ~(CBIES);
}

//*****************************************************************************
//
//! \brief Toggles the edge direction that would trigger an interrupt.
//!
//! This function will toggle which direction the output will have to go,
//! whether rising or falling, to generate an interrupt based on a non-inverted
//! interrupt. If the direction was rising, it is now falling, if it was
//! falling, it is now rising.
//!
//! \param baseAddress is the base address of the COMP_B module.
//!
//! \return None
//
//*****************************************************************************
void COMP_B_interruptToggleEdgeDirection(uint16_t baseAddress)
{
        HWREG16(baseAddress + OFS_CBCTL1) ^= CBIES;
}

//*****************************************************************************
//
//! \brief Turns on the COMP_B module.
//!
//! This function sets the bit that enables the operation of the COMP_B module.
//!
//! \param baseAddress is the base address of the COMP_B module.
//!
//! \return None
//
//*****************************************************************************
void COMP_B_enable(uint16_t baseAddress)
{
        HWREG16(baseAddress + OFS_CBCTL1) |= CBON;
}

//*****************************************************************************
//
//! \brief Turns off the COMP_B module.
//!
//! This function clears the CBON bit disabling the operation of the COMP_B
//! module, saving from excess power consumption.
//!
//! \param baseAddress is the base address of the COMP_B module.
//!
//! \return None
//
//*****************************************************************************
void COMP_B_disable(uint16_t baseAddress)
{
        HWREG16(baseAddress + OFS_CBCTL1) &= ~(CBON);
}

//*****************************************************************************
//
//! \brief Shorts the two input pins chosen during initialization.
//!
//! This function sets the bit that shorts the devices attached to the input
//! pins chosen from the initialization of the COMP_B.
//!
//! \param baseAddress is the base address of the COMP_B module.
//!
//! \return None
//
//*****************************************************************************
void COMP_B_shortInputs(uint16_t baseAddress)
{
        HWREG16(baseAddress + OFS_CBCTL1) |= CBSHORT;
}

//*****************************************************************************
//
//! \brief Disables the short of the two input pins chosen during
//! initialization.
//!
//! This function clears the bit that shorts the devices attached to the input
//! pins chosen from the initialization of the COMP_B.
//!
//! \param baseAddress is the base address of the COMP_B module.
//!
//! \return None
//
//*****************************************************************************
void COMP_B_unshortInputs(uint16_t baseAddress)
{
        HWREG16(baseAddress + OFS_CBCTL1) &= ~(CBSHORT);
}

//*****************************************************************************
//
//! \brief Disables the input buffer of the selected input port to effectively
//! allow for analog signals.
//!
//! This function sets the bit to disable the buffer for the specified input
//! port to allow for analog signals from any of the COMP_B input pins. This
//! bit is automatically set when the input is initialized to be used with the
//! COMP_B module. This function should be used whenever an analog input is
//! connected to one of these pins to prevent parasitic voltage from causing
//! unexpected results.
//!
//! \param baseAddress is the base address of the COMP_B module.
//! \param inputPort is the port in which the input buffer will be disabled.
//!        Valid values are:
//!        - \b COMP_B_INPUT0 [Default]
//!        - \b COMP_B_INPUT1
//!        - \b COMP_B_INPUT2
//!        - \b COMP_B_INPUT3
//!        - \b COMP_B_INPUT4
//!        - \b COMP_B_INPUT5
//!        - \b COMP_B_INPUT6
//!        - \b COMP_B_INPUT7
//!        - \b COMP_B_INPUT8
//!        - \b COMP_B_INPUT9
//!        - \b COMP_B_INPUT10
//!        - \b COMP_B_INPUT11
//!        - \b COMP_B_INPUT12
//!        - \b COMP_B_INPUT13
//!        - \b COMP_B_INPUT14
//!        - \b COMP_B_INPUT15
//!        - \b COMP_B_VREF
//!        \n Modified bits are \b CBPDx of \b CBCTL3 register.
//!
//! \return None
//
//*****************************************************************************
void COMP_B_disableInputBuffer(uint16_t baseAddress,
                               uint8_t inputPort)
{
        assert(inputPort <= COMP_B_INPUT15);

